CSI API ETABS v1
cPluginContract.Info Method
 Provides information about the plugin
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int Info(
	ref string Text
)
Function Info (
	ByRef Text As String
) As Integer
Dim instance As cPluginContract
Dim Text As String
Dim returnValue As Integer
returnValue = instance.Info(Text)
int Info(
	String^% Text
)
abstract Info :
        Text : string byref -> int
Parameters
Text
Type: System.String
 Information about the plugin, e.g. author, version, description
Return Value
Type: Int32
 Returns zero if the information is successfully retrieved; otherwise it returns a nonzero value
See Also
Reference
cPluginContract Interface
ETABSv1 Namespace